trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/ABCКлассификацияНоменклатуры_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ABCКлассификацияНоменклатуры_Альтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="80d8f3a4-6b7b-4718-8ee3-b7242a527914">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТабДок.Очистить();
	Макет = РегистрыСведений.ABCКлассификацияНоменклатуры_Альтерра.ПолучитьМакет("ТекущаяКлассификация");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Подразделение,
	               |	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Класс,
	               |	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Подразделение.Код КАК ПодразделениеКод
	               |ИЗ
	               |	РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних(, Номенклатура = &Номенклатура) КАК ABCКлассификацияНоменклатуры_АльтерраСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПодразделениеКод";
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") тогда
		Номенклатура = Параметры.Отбор.Номенклатура;
	ИначеЕсли   Список.Отбор.Элементы.Количество()>0 тогда
		Номенклатура = Список.Отбор.Элементы[0].ПравоеЗначение;
	Иначе 
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ТекущаяКлассификация Тогда
		ПриСозданииНаСервере(Истина, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.ФормаЗаписи", Новый Структура("Номенклатура", Список.Отбор.Элементы[0].ПравоеЗначение), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеСоздания(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КОнецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСоздания", ЭтаФорма);
	ОткрытьФорму("РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.ФормаЗаписи", Новый Структура("ЗначениеЗаполнения", Элементы.Список.ТекущиеДанные), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
